0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    hs1
    {
        type            calculated;
        value           uniform 101325;
    }

    hs2
    {
        type            calculated;
        value           uniform 101325;
    }
    walls
    {
        type            calculated;
        value           uniform 101325;
    }
    inlet
    {
        type            calculated;
        value           uniform 101325;
    }
    outlet
    {
        type            calculated;
        value           uniform 101325;
    }
}


// ************************************************************************* //
// ***************************  tensor-PCB-2024  *************************** //
// *****************************  pttensor.com  **************************** //
