system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


convertToMeters 1;

vertices
(
    (-0.002 -0.002 -0.052) //0
    (0.103 -0.002 -0.052) //1
    (0.103 0.022 -0.052) //2
    (-0.002 0.022 -0.052) //3

    (-0.002 -0.002 0.002) //0
    (0.103 -0.002 0.002) //1
    (0.103 0.022 0.002) //2
    (-0.002 0.022 0.002) //3

);


blocks
(
    hex (0 1 2 3 4 5 6 7)(120 30 120)
    simpleGrading (1 1 1)

);

boundary
(
    wall
    {
        type wall;
        faces
        (
            (0 1 2 3)
            (1 2 5 6)
            (0 3 7 4)
            (0 1 5 4)
            (3 2 6 7)
            (4 5 6 7)
        );
    }
    
);

// ************************************************************************* //
// ***************************  tensor-PCB-2024  *************************** //
// *****************************  pttensor.com  **************************** //
